<a href="https://colab.research.google.com/github/anirbanghoshsbi/pandas/blob/master/pandas_drop_conditional_selection.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
#import the libraries
import pandas as pd

In [0]:
# read the dataset
ufo = pd.read_csv('http://bit.ly/uforeports')

In [64]:
# check the head
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [68]:
# check the shape
# check the dim
print(ufo.ndim)
print(ufo.size)
ufo.shape

2
4225

(845, 5)

In [0]:
#get rid of the colors reported column
ufo.drop('Colors Reported',axis=1 ,inplace=True)

In [46]:
ufo.head()

                   City Shape Reported State             Time
0                Ithaca       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro          OTHER    NJ  6/30/1930 20:00
2               Holyoke           OVAL    CO  2/15/1931 14:00
3               Abilene           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair          LIGHT    NY  4/18/1933 19:00

In [0]:
#drop multiple columns says sity and state
ufo.drop(['City','State'], axis=1 , inplace=True)

In [48]:
ufo.head()

  Shape Reported             Time
0       TRIANGLE   6/1/1930 22:00
1          OTHER  6/30/1930 20:00
2           OVAL  2/15/1931 14:00
3           DISK   6/1/1931 13:00
4          LIGHT  4/18/1933 19:00

In [0]:
#remove rows
ufo.drop([0,1],axis=0,inplace=True)

In [50]:
ufo.head(10)

   Shape Reported              Time
2            OVAL   2/15/1931 14:00
3            DISK    6/1/1931 13:00
4           LIGHT   4/18/1933 19:00
5            DISK   9/15/1934 15:30
6          CIRCLE    6/15/1935 0:00
7            DISK    7/15/1936 0:00
8           CIGAR  10/15/1936 17:00
9        CYLINDER    6/15/1937 0:00
10          LIGHT   8/15/1937 21:00
11       FIREBALL    6/1/1939 20:00

In [0]:
#removing rows by conditional slicing here we keep the rows that I need and the rest are removed
ufo=(ufo[ufo['Shape Reported']=='OVAL'])

In [0]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [74]:
ufo.head(10)

                   City Colors Reported Shape Reported State              Time
0                Ithaca             NaN       TRIANGLE    NY    6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ   6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO   2/15/1931 14:00
3               Abilene             NaN           DISK    KS    6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY   4/18/1933 19:00
5           Valley City             NaN           DISK    ND   9/15/1934 15:30
6           Crater Lake             NaN         CIRCLE    CA    6/15/1935 0:00
7                  Alma             NaN           DISK    MI    7/15/1936 0:00
8               Eklutna             NaN          CIGAR    AK  10/15/1936 17:00
9               Hubbard             NaN       CYLINDER    OR    6/15/1937 0:00

In [0]:
#suppose I wanted to keep more than one conditions here 
# I can write | for or
ufo_2=ufo[(ufo['Shape Reported']=='OVAL') | (ufo['Shape Reported']=='TRIANGLE') ]

In [78]:
ufo_2.head(10)

              City Colors Reported Shape Reported State             Time
0           Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
2          Holyoke             NaN           OVAL    CO  2/15/1931 14:00
13          Keokuk             NaN           OVAL    IA    7/7/1939 2:00
39     San Antonio             NaN           OVAL    NM  8/16/1945 11:30
46  South Portland             NaN           OVAL    ME   7/1/1946 13:30
52       San Deigo             NaN       TRIANGLE    CA  4/15/1947 23:00
63       Baltimore             NaN           OVAL    MD  6/30/1947 18:00
68         Seattle             NaN           OVAL    WA   7/4/1947 17:30
83           Raton             NaN           OVAL    NM  7/20/1947 22:00
93       Baltimore             NaN           OVAL    MD   6/30/1948 0:00

In [0]:
# the above code having multiple boolean conditions can be re-written as 
ufo_2_1=ufo[ufo['Shape Reported'].isin(['OVAL','TRIANGLE'])]

In [85]:
ufo_2_1.shape

(2734, 5)

In [86]:
ufo_2.shape

(2734, 5)

In [0]:
movies = pd.read_csv('http://bit.ly/imdbratings')

In [89]:
# check the head 
movies.head()

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [90]:
# check the shape
movies.shape

(979, 6)

In [0]:
#applying multiple filtering ceiteria
# I want all movies with genre Crime or Action and duration less than 200 minutes.
movies_1=movies[((movies['genre']=='Crime')|(movies['genre']=='Action') & (movies['duration']<200))]

In [94]:
movies_1.shape

(259, 6)

In [0]:
movies_2=movies[movies['genre'].isin(['Crime','Action']) & (movies['duration']<200)]

In [100]:
movies_2.shape

(257, 6)